# ToString Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementId..::..ToString Method
ElementId Class See Also
---
Gets a String representation of the value of the id.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string ToString()
```

Visual Basic
---
```text
Public Overrides Function ToString As String
```

Visual C++
---
```text
public:
virtual String^ ToString() override
```

# See Also
ElementId Class
Autodesk.Revit.DB Namespace